import Container from '@mui/material/Container'

function Home() {
    return (
        <><div>หน้าแรก</div><div>
            <Container maxWidth="md">
                <h2 style={{ textAlign: "center" }}>ระบบประเมินอาจารย์</h2>
                <h4>Requirements</h4>
                <p>
                ระบบประเมินผู้สอน เป็นการให้ผู้ใช้ทำการประเมินผู้สอนในรายวิชาที่ผู้ใช้ได้ลงทะเบียนเรียน โดยจะมีการแยกหมวดหมู่หัวข้อในการประเมิน 
                เช่น คุณภาพเนื้อหาในการสอนระดับความยากของเนื้อหา เวลาที่ใช่ในการสอน เป็นต้น และจะมีแต่ละระดับในการให้คะแนนในการ
                ประเมินผู้สอน เช่น ดีเยี่ยม(5) ดี(4) ปานกลาง(3) เป็นต้น
                </p>
            </Container>

            <Container maxWidth="md">
                <h2 style={{ textAlign: "center" }}>ระบบลงทะเบียนเรียน</h2>
                <h4>Requirements</h4>
                <p>
                ระบบลงทะเบียนเรียนเป็นระบบที่ให้สมาชิก loginเข้าสู่ระบบเพื่อลงทะเบียนเรียน สามารถเลือกรายวิชาที่ต้องการลงทะเบียน
                โดยจะมีวิชาให้เลือกเพื่อที่จะสะดวกต่อการลงทะเบียนในวิชาเรียนที่ต้องการ อีกทั้งยังทราบรายละเอียดวิชาเช่น ชื่อวิชาเรียนซึ่งอยู่ในวิชาเรียนและ
                สามารถเลือกสถานะวิชาเรียนว่าต้องการเรียนแบบไหน Online  Onsite หรือ Hybride ซึ่งรายละเอียดจะอยู่ในระบบลงทะเบียนเรียน
                </p>
            </Container>
        </div></>
    )
}

export default Home; 