import Container from '@mui/material/Container'

function Home() {
    return (
        <><div>หน้าแรก</div><div>


            <Container maxWidth="md">
                <h1 style={{ textAlign: "center" }}>ระบบหลัก  ระบบลงทะเบียนเรียน</h1>
                <h4>Requirements</h4>
                <p>
                    ระบบลงทะเบียนเรียนเป็นระบบที่ให้นักศึกษาชั้นปีที่3 สาขาวิศวกรรมคอมพิวเตอร์หรือผู้ใช้
                    ระบบซึ่งเป็นสมาชิก สามารถ login เข้าระบบเพื่อลงทะเบียนเรียนได้ โดยสมาชิกที่เป็นนักศึกษาหรือผู้ที่สนใจ
                    แต่ละคนสามารถเลือกรายวิชาที่ตนเองสนใจ ที่เปิดสอนในเทอมนั้นๆได้

                </p>
            </Container>

            <Container maxWidth="md">
                <h2 style={{ textAlign: "center" }}>ระบบข้อมูลนักศึกษา</h2>
                <h4>Requirements</h4>
                <p>
                    ระบบข้อมูลนักศึกษาจะมีการเก็บข้อมูลของนักศึกษาไว้ เช่น รหัสนักศึกษา ชื่อ-นามสกุล ชั้นปี เกรด
                    สำนักวิชา อาจารย์ที่ปรึกษา และยังมีข้อมูลส่วนตัว วัน เดือน ปีเกิด ที่อยู่ ผู้ปกครอง เบอร์โทรศัพท์
                    ผู้ดูแลระบบจะมีการกำหนด Username และ Password ของนักศึกษาแต่ละคนไว้ เมื่อนักศึกษาทำการ
                    login ด้วย Username และ Password ของตนเองถูกต้อง ก็จะสามารถเข้าสู่ระบบได้ และสามารถ
                    ทำการระบบลงทะเบียนเรียนในขั้นตอนต่อไปได้  หากมีการกรอก Username และ Password ไม่ถูกต้อง
                    ระบบจะแสดงข้อความ “ รหัสนักศึกษาหรือรหัสผ่านไม่ถูกต้อง ” ระบบจะให้กรอกข้อมูลใหม่อีกครั้ง
                </p>
            </Container>

            <Container maxWidth="md">
                <h2 style={{ textAlign: "center" }}>ระบบรายวิชา</h2>
                <h4>Requirements</h4>
                <p>
                    ระบบรายวิชา เป็นระบบที่มีข้อมูลที่เกี่ยวกับรายวิชา เช่น ชื่อวิชา สำนักวิชา อาจารย์ผู้สอน หน่วยกิตของรายวิชา 
                    ช่วงเวลาที่เรียน และอื่นๆ ประกอบ และนอกจากนี้ยังสามารถให้ผู้ใช้ที่เป็นอาจารย์ประจำสาขาวิชาหรือ
                    ผู้ดูแลสามารถเลือกรายวิชาที่เปิดสอนในแต่ละเทอมได้ โดยจะเก็บไว้ที่ list รายวิชาที่เปิดสอนในเทอมนั้นๆได้
                    และยังสามารถเพิ่มข้อมูลภายใน list ได้
                </p>
            </Container>

            <Container maxWidth="md">
                <h2 style={{ textAlign: "center" }}>ระบบข้อมูลอาจารย์</h2>
                <h4>Requirements</h4>
                <p>
                ระบบข้อมูลอาจารย์เก็บข้อมูลของอาจารย์ ซึ่งระบบย่อยนี้ทำขึ้นเพื่อ สมาชิกผู้ดูแลระบบอาจารย์จะได้สามารถ
                บันทึกข้อมูลอาจารย์ได้โดยง่าย ซึ่งข้อมูลที่ต้องการ ยกตัวอย่างเช่น สาขาวิชา ข้อมูลเจ้าหน้าที่ ระดับการศึกษา  
                เพื่อสามารถเข้าถึงข้อมูลอาจารย์ได้ง่ายถูกต้อง และมีระเบียบมากขึ้นโดยใช้ Email เป็นตัว verify ตัวตนของสมาชิกผู้ดูแลระบบ
                </p>
            </Container>

            <Container maxWidth="md">
                <h2 style={{ textAlign: "center" }}>ระบบการชำระเงิน</h2>
                <h4>Requirements</h4>
                <p>
                ระบบชำระค่าลงทะเบียนเรียน เป็นระบบที่สามารถชำระเงินของรายวิชาที่ลงทะเบียนได้  โดยระบบจะทำการบันทึกข้อมูลรหัสนักศึกษา 
                วันที่นักศึกษาชำระค่าลงทะเบียนเรียน ชำระทั้งหมด รายวิชาที่ชำระ โดยระบบจะมีช่องทางการชำระค่าลงทะเบียนเรียน 
                เมื่อกดบันทึกแล้วจะแสดงรายละเอียดต่างๆบนบิลการชำระเงิน โดยที่จะมีผู้ดูแลระบบการเงินเป็นผู้ดูแลและตรวจสอบความถูกต้อง
                </p>
            </Container>
        </div></>
    )
}

export default Home; 