import Container from '@mui/material/Container'

function Home() {
    return (
        <><div>หน้าแรก</div><div>
            <Container maxWidth="md">
                <h1 style={{ textAlign: "center" }}>ระบบข้อมูลนักศึกษา</h1>
                <h4>Requirements</h4>
                <p>
                    ระบบลงทะเบียนเรียนของมหาวิทยาลัย ABC เป็นระบบที่ให้ผู้ใช้ นักศึกษาที่เป็นสมาชิก สามารถ login เข้าสู่ระบบได้
                    โดยทางระบบข้อมูลนักศึกษาจะมีการเก็บข้อมูลของนักศึกษาไว้แล้ว เช่น ชื่อ-นามสกุล รหัสนักศึกษา ชั้นปี เกรด
                    สำนักวิชา อาจารย์ที่ปรึกษา และยังมีข้อมูลส่วนตัว วัน เดือน ปีเกิด ที่อยู่ ผู้ปกครอง เบอร์โทรศัพท์
                    ผู้ดูแลระบบจะมีการกำหนด Username และ Password ของนักศึกษาแต่ละคนไว้ เมื่อนักศึกษาทำการ
                    login ด้วย Username และ Password ของตนเองถูกต้อง ก็จะสามารถเข้าสู่ระบบได้ และสามารถ
                    ทำการระบบลงทะเบียนเรียนในขั้นตอนต่อไปได้  หากมีการกรอก Username และ Password ไม่ถูกต้อง
                    ระบบจะแสดงข้อความ “ Username และ Password ไม่ถูกต้อง ” ระบบจะให้กรอกข้อมูลใหม่อีกครั้ง
                </p>
            </Container>

            <Container maxWidth="md">
                <h1 style={{ textAlign: "center" }}>ระบบรายวิชา</h1>
                <h4>Requirements</h4>
                <p>
                    ระบบลงทะเบียนเรียนเป็นระบบที่ให้นักศึกษาชั้นปีที่3 สาขาวิศวกรรมคอมพิวเตอร์หรือผู้ใช้
                    ระบบซึ่งเป็นสมาชิก สามารถ login เข้าระบบเพื่อลงทะเบียนเรียนได้ โดยสมาชิกที่เป็นนักศึกษาหรือผู้ที่สนใจ
                    แต่ละคนสามารถเลือกรายวิชาที่ตนเองสนใจ ที่เปิดสอนในเทอมนั้นๆได้ ระบบลงทะเบียนเรียน เป็นระบบที่
                    สามารถบันทึกจำนวนนักศึกษาที่ลงทะเบียนเรียนในแต่ละรายวิชาได้ รวมทั้งยังมีข้อมูลที่เกี่ยวกับรายวิชาเช่น
                    ชื่อวิชา สำนักวิชา อาจารย์ผู้สอน หน่วยกิตของรายวิชา ช่วงเวลาที่เรียน และอื่นๆ ประกอบ และยังสามารถ
                    คำนวณค่าใช้จ่ายที่ลงทะเบียนเรียนได้ และนอกจากนี้ยังสามารถให้ผู้ใช้ที่เป็นอาจารย์ประจำสาขาวิชาหรือ
                    ผู้ดูแลสามารถเลือกรายวิชาที่เปิดสอนในแต่ละเทอมได้ โดยจะเก็บไว้ที่ list รายวิชาที่เปิดสอนในเทอมนั้นๆได้
                    และยังสามารถเพิ่ม ลบหรือแก้ไข ข้อมูลภายใน list ได้
                </p>
            </Container>

            <Container maxWidth="md">
                <h1 style={{ textAlign: "center" }}>ระบบข้อมูลอาจารย์</h1>
                <h4>Requirements</h4>
                <p>
                    ใส่เพิ่ม
                </p>
            </Container>

            <Container maxWidth="md">
                <h1 style={{ textAlign: "center" }}>ระบบการชำระเงิน</h1>
                <h4>Requirements</h4>
                <p>
                    ใส่เพิ่ม
                </p>
            </Container>
        </div></>
    )
}

export default Home; 